Revit 2027 API
BindingMap.Insert Method
Creates a new parameter binding.
Overload List
Name | Description
Insert(Definition, Binding) | Creates a new parameter binding between a parameter and a set of categories.
Insert(Definition, Binding, ForgeTypeId) |  Creates a new parameter binding between a parameter and a set of categories in a specified group.
Top
See Also
Reference
BindingMap Class
Autodesk.Revit.DB Namespace